//что ж а теперь одно из самых главных вещей
		//отладка
		// запуск отладки делается через вернюю панель (Отладка --> Начать отладку)
		//или же просто нажатием клавиши F5
		//еще можно нажать F10 кста (но тогда отладка пойдет с самого начала проги, пошагово. Ты просто можешь заскучать)
		//чаще всего используется F5
		//Но как именно это делается
		//слева есть поле серенькое, ты можешь туда ткнуть мышкой и поставится точка остановы, либо же просто нажать клавишу F9
		//и тогда точка остановы появится там где стоит твой курсор
		//после того как поставил точку остановы запускаешь отладку и смотришь как это все работает
		// 
		// Функция 1 ШАГ С ОБХОДОМ
		//после запуска через F5 нажимая F10 ты будешь двигаться пошагово (это удобно)
		// 
		//Функция 2 ЗАКРЕПЛЕНИЕ ЗАНЧЕНИЙ ПЕРЕМЕННЫХ
		//один раз наведись на переменную и нажми на иглу (значок справа)
		//Функция 3 две кнопки остановы
		//ты можешь поставить две или даже больше кнопок остановы
		//это надо для того, чтобы ты посмотрел сначала одну часть кода, а потом сразу смотрел на следующую
		//как это сделать: поставь кнопки остановы --> нажми F5 чтобы начать отладку (ты остановишься на первой точке)
		//--> нажми еще раз F5 и ты перейдешь на следующую точку
		//
		//Функция 4 ШАГ С ЗАХОДОМ
		//это надо для тог чтобы увидеть что именно делает та или иная функция
		//как сделать: запуск отладки через F5 --> нажимаем F11 --> наюлюдаем что именно делает функция


		//Для того чтобы остановить отладку используй комбину Shift + F5 или меню сверху (Отладка --> Завершить отладку)
		//И да умник, только так надо ее останавливать, не крестик нажать и не жмякать на все кнопки подряд
		//А если ты все таки попытаешься так сделать то будет плохо (VS на тебя так ругаться будет ооооо)
