#include<iostream> 
using namespace std;

void main()
{
	setlocale(LC_ALL, "Rus");     

	cout << "двухмерный массив" << NEW_LINE;
	//да это жестко
	//он устроен как координатная сетка
	//прям тут в коммах я изображу
	/*

	  0   |   1   |    2    |    3    |     4   <----------это колонки col
	0     |       |         |         |
		    |-------|---------|---------|---------
	1     |       |         |         |
		    |-------|---------|---------|---------
	2     |       |         |         |
	^
	|
	|
	|
	а это строки row

	UPD как то так
	*/
	//теперь синтаксис

	const int ROW = 3;//в основном при объявлении массивов используют две константы, ROW COL. Это ROW
	const int COL = 4;// а это COL
	int plm[ROW][COL];

	plm[0][1] = 8;
	cout << plm[0][1] << NEW_LINE;

	int plm2[ROW][COL] //ФАКТ можно не уточнить количество строк, но уточнить количество колонок нужно
	{
		{25,789,451,15616},
		{494,56195,4899,23636},
		{484,651,021,555}
	};//один из вариантов как заполнить массив ручками


	//а теперь как сделать это не своими ручками
	const int ROWS = 5;
	const int COLS = 8;
	int twomass[ROWS][COLS];

	for (int i = 0; i < ROWS; i++)
	{
		for (int j = 0; j < COLS; j++)
		{
			twomass[i][j] = rand() % 10;

		}
	}
	for (int i = 0; i < ROWS; i++)
	{
		for (int j = 0; j < COLS; j++)
		{
			cout << twomass[i][j] << TAB;


		}
		cout << NEW_LINE;
	}



	//что же надо выкурить чтобы им пользоваться

	//особо ничего не меняется, просто 2д поле превращается в 3д, а также теперь сначала надо написать к какой именно сетке ты обращаешься
	//если честно то он возможно даже не пригодится

	//синтаксис тот же самый токо скобочки прибавляются
}
