#include<iostream> 
using namespace std;


void foo2(int a = 5)
{
	for (int i = 1; i < a; i++)// сначала всегда объявляются переменные БЕЗ ЗНАЧЕНИЙ ПО УМОЛЧАНИЮ, только потом переменные которые такие значения имеют
	{
		cout << "#" << endl;

	}
}

void main()
{
	setlocale(LC_ALL, "Rus");     

	cout << "Области видимости" << NEW_LINE;
	//переменные делятся на два типа
	//глобальные и локальные
	// вообще сами по себе локальные переменные видны только в промежутке между фигурными скобками (любыми)

	//глобальная же переменная содается вне каких либо фиг. скобок и видна везде (какой бы зажопинс это не был)
	//но не злоупотребляй глобальными переменными, это ДУРНОЙ ТОН!!!!	

	cout << "Параметры по умолчаннию" << NEW_LINE;
	foo2();
	// данная функция выведет 5 решеток (если ничего не менять)
  
}
