#include<iostream> //данная команда подключает в код библиотеку под названием iostream

using namespace std;
/*
В языке С++ существует такое понятние как пространство имен
Это пространство определяетнекую область ,на которую приходятся действия оператора или ф-ии
Для того чтобы использовать оператор, находящийся в определенном пространстве,
необходимо подключить это пространство в эту самую программу
здесь подключается пространство под названием std
*/

void main()
{
	setlocale(LC_ALL, "Rus");     //ф-я отвечающая за вывод русских символов в консоль
	cout << "привет\n";       //вывод в консоль

	const int DAYS_IN_WEEK = 7; //const это констанста!

	/* прямо в кавычках при выводе в консоле можно делать вот так: 
	
		\b Удаление последнего выведенного символа
		\n перейти на начало новой строки
		\t перейти к слеедующей позиции табуляции

		////////////////////////////////////////////////////

		\\ вывести обратную черту \
		\" вывести двойную кавычку
		\' вывести одинарную кавычку '
	*/

	const char NEW_LINE = '\n'; //в дальнейшем везде вместо endl я использовал ЭТО, просто знайте

	const char TAB = '\t\t\t';

	cout << DAYS_IN_WEEK << NEW_LINE;

	cout << "№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№" << NEW_LINE;
	//высчитать сумму произведение и среднее алифметическое
	int Var, Var2, Var3, sum, proiz, srednee;

	cout << "Введите первое  число!" << NEW_LINE;
	cin >> Var;

	cout << "Введите второе  число!" << NEW_LINE;
	cin >> Var2;

	cout << "Введите третье число!" << NEW_LINE;
	cin >> Var3;

	sum = Var + Var2 + Var3;
	proiz = Var * Var2 * Var3;
	srednee = (Var + Var2 + Var3) / 3;
	cout << "Сумма введенных вами чисел равна:" << NEW_LINE;
	cout << sum << NEW_LINE;
	cout << "Произведение введенных вами чисел равно:" << NEW_LINE;
	cout << proiz << NEW_LINE;
	cout << "Средднее арифметичекое введеных вами чисел равно:" << NEW_LINE;
	cout << srednee << NEW_LINE;
}
