#include<iostream>
#include<string>
#include<ctime>
#include<math.h>


//#define DEBUG


//define позволяет нам заменять какую либо часть на букавки, что нам удобнее, например 
#define PI 3.14 //вместо того чтобы вечно писать 3.14 мы будем писать PI и будем понимать что мы имеем число пи
#define MATH_TIMES(x, y) ((x)*(y))


using namespace std;

void main()
{
	setlocale(LC_ALL, "Rus");
	srand(time(NULL));

	cout << "конкатенация строк" << endl;
	//конкатенация - объединение каких-либо элементов, в один элемент
	//сначала рассмотрим стиль С, именно С
	char str1[255] = "Hello";
	char str2[255] = "World";
	cout << str1 << endl;//тут посмотрим как было, 255 надо чтобы было место куда дописывать новые строки

	strcat_s(str1, str2);//тут с помощью ф-ии strcat_s мы слепим строки, и получим результат в str1, именно туда

	cout << str1 << endl; // тут увидим как стало

	//а теперь в С++, тут все проще, одна библиотека string и мы получаем совсееем другой синтасис
	//по сути string является самым настоящим НОВЫМ типом данных, и с ним намного удобнее работать!
	string stroka1 = "Hello"; //вот так и работает, легко и просто, нам не надо указывать какого размера эта вещь, это все произойдет за кадром
	string stroka2 = "World!";
	string result;
	result = stroka1 + " " + stroka2 + "Клево правда?";

	cout << result << endl;//при желании можно добавлять сколько душе угодно
}
