#include<iostream> 
using namespace std;

void foo()
{
	cout << "Я функция. Меня опять вызвали" << endl;

}

inline int Sum(int a, int b)
{
	return a + b;	
}

void main()
{
	setlocale(LC_ALL, "Rus");     

	cout << "Функции" << NEW_LINE;
	//да мы до них дошли
	//функция это такая штука котрая позволяет вынести какой-то часто повторяющийся участок кода вынести отдельно и исользовать потом более легко
	//синтаксис
	/*

	возвращаемое_значение имя_функции (параметры)
	{
	блок_повторяющегося_кода (тело);
	}

	*/
	//параметры это то что укажет функции, с чем именно ей надо работать

	//функция должна быть объявлена раньше ее вызова, иначе компилятор просто не поймет с чем работать
	//объявлять функцию - написать функцию
	//вызвать функцию - ну просто сказать в коде сделай это

	//если хочешь посмотреть на саму функцию то посмотри на саааааамом верху (75 cтрока)

	foo();

	for (int i = 0; i < 20; i++)
	{
		foo();
	}

	a = 25;
	b = 9;
	cout << Sum(a, b) << NEW_LINE;

	//передеча параметров в функцию
	//в функцию передается не введенная переменная а ее точная копия
	//для того чтобы значение изменилось  надо сделать обязательно return
	//это работает только если параметр передается ПО ЗНАЧЕНИЮ!!!
	// есть еще через ссылки и через указатели
}
