#include<iostream> 
using namespace std;

void main()
{
	setlocale(LC_ALL, "Rus");     

	cout << "указатели" << NEW_LINE;

	//Указатель - переменная которая содержит адрес другого объекта

	int ua = 5;

	int* px = &ua; //Это сам указатель, вместо px может стоять все что угодно
	//* говорит компилятору что переменная типа указатель
	//& а вот это АМПЕРСАНТ, в данном случае он говорит компилятору том что мы берем адрес переменной ua и заносим его в переменную

	//префикс p с английского pointer , x просто значение || просто принято добавлять p

	//у указателей есть свои типы данных, и он должен соответствовать типу данных объекта, на который хочешь указать

	cout << px << NEW_LINE; //выведется тебе число в 16-ричной системе || прикол кста, каждый раз значение будет менятся

	*px; //это операция разыменования

	cout << *px << NEW_LINE; //слеловательно так выведется само значение переменной
}
