#include<iostream> 
using namespace std;

void main()
{
	setlocale(LC_ALL, "Rus");     

	cout << "арифметика указателей" << NEW_LINE;
	const int MASSP = 5;

	int k[MASS]{ 4,789,4456,49884,11 };
	for (int i = 0; i < MASS; i++)
	{
		cout << k[i] << NEW_LINE;
		
	}
	//вот ты сейчас сидишб такой и думаешь, это же не указатель || еще какой это указатель
	//имя массива это указатель на его первую переменную

	int *pk = k; //то есть все операции которые мы делали с массивами полностью подходят к указателям

	
	for (int i = 0; i < MASS; i++)
	{
		cout << pk[i]/*ты не знал а надо, вот эта индексация и есть арифметика указателей*/ << NEW_LINE;

	} //дада все так вот интересно

	
	for (int i = 0; i < MASS; i++)
	{
		cout << *(pk+i) << NEW_LINE; //вот так еще тоже можно вывести инфу из указателя

	}
}
