#include<iostream> 
using namespace std;

void main()
{
	setlocale(LC_ALL, "Rus");     

	cout << "Операторы выделения динамической памяти new и delete" << NEW_LINE;
	//сразу к делу, оператор new позволяет взть какойто кусочек от оперативки(прям отдельно от кода!)и заполнить его чем-то
	//таким образом из исходного кода на это значение будет указывать указатель, выглядеть будет это примерно так
	int* ps = new int; //вот эта запись запрашивает у оперативки новый слот ЧИСТО под int, то бишь 4 байта
	*ps = 10;//мы присвоили значение
	cout << *ps << NEW_LINE;//а потом ввели. И да это значение получено из оперативки ВНЕ нашего кода
	//а теперь какая естть одновременно проблема, и одновременно достоинство в C++

	//у С++ нет авто-сборщика мусора
	//то есть выделяя место под это самое 10, никто кроме нас не позаботится убрать этот слот(есди его не убрать считайте у вас нет оперативки больше!)
	//а это значит что очсита этого самого слота должна происходить вручную, и это только сейчас там всего тип int, оюычно new используют 
	//для более сложных операций, с динамическими массивами, большими циклами и т.д.
	//чтобы засора не было, используют слово delete
	delete ps; //вот она и операция delete


	//гениальный совет, сразу после того как написал new сразу напиши delete и пиши код между этими двумя командами, так не забудешь!
}
